{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Action",
    "1": "Adventure",
    "2": "Animation",
    "3": "Biography",
    "4": "Crime",
    "5": "Family",
    "6": "Fantasy",
    "7": "Film-noir",
    "8": "History",
    "9": "Horror",
    "10": "Mystery",
    "11": "Romance",
    "12": "Scifi",
    "13": "Sports",
    "14": "Thriller",
    "15": "War"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Action": 0,
    "Adventure": 1,
    "Animation": 2,
    "Biography": 3,
    "Crime": 4,
    "Family": 5,
    "Fantasy": 6,
    "Film-noir": 7,
    "History": 8,
    "Horror": 9,
    "Mystery": 10,
    "Romance": 11,
    "Scifi": 12,
    "Sports": 13,
    "Thriller": 14,
    "War": 15
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
